// .vitepress/data/quotes.js
export const quotes = [
  { text: "星星之火，可以燎原。", source: "《星星之火，可以燎原》" },
  { text: "世上无难事，只要肯登攀。", source: "《水调歌头·重上井冈山》" },
  { text: "自信人生二百年，会当水击三千里。", source: "《七古·残句》" },
  { text: "一万年太久，只争朝夕。", source: "《满江红·和郭沫若同志》" },
  { text: "为有牺牲多壮志，敢教日月换新天。", source: "《七律·到韶山》" },
  { text: "不管风吹浪打，胜似闲庭信步。", source: "《水调歌头·游泳》" },
  { text: "雄关漫道真如铁，而今迈步从头越。", source: "《忆秦娥·娄山关》" },
  { text: "踏遍青山人未老，风景这边独好。", source: "《清平乐·会昌》" },
  { text: "待到山花烂漫时，她在丛中笑。", source: "《卜算子·咏梅》" },
  { text: "俱往矣，数风流人物，还看今朝。", source: "《沁园春·雪》" },
  { text: "不到长城非好汉，屈指行程二万。", source: "《清平乐·六盘山》" },
  { text: "无限风光在险峰。", source: "《七绝·为李进同志题所摄庐山仙人洞照》" },
  { text: "天若有情天亦老，人间正道是沧桑。", source: "《七律·人民解放军占领南京》" },
  { text: "文明其精神，野蛮其体魄。", source: "《体育之研究》" },
  { text: "牢骚太盛防肠断，风物长宜放眼量。", source: "《七律·和柳亚子先生》" }
]